
# -------------здесь координаты узлов-----------------

# СМП: id 0...20
nodes_default = [(235, 207), (275, 239), (261, 252), (250, 261), (233, 233), (299, 219), (321, 217),
                 (339, 203), (378, 194), (410, 163), (412, 201), (426, 224), (500, 164), (585, 185),
                 (739, 207), (774, 212), (800, 257), (778, 241), (773, 263), (700, 334), (596, 392)]
# путь через Суэц: id 21...36
nodes_default += [(544, 406), (551, 428), (586, 428), (558, 444), (554, 463), (536, 477), (481, 545), (324, 474),
                  (307, 471), (173, 428), (87, 427), (92, 344), (106, 359), (120, 347), (132, 335), (143, 316)]
# Жд (транссиб): id 37...42
nodes_default += [(236, 285), (256, 310), (389, 338), (542, 334), (614, 351), (583, 392)]
# трубопровод: id 43...44
nodes_default += [(223, 272), (105, 320)]


# -----------------ребра между узлами из списка выше-------------------

# СМП: id 0...25
edges_default = [(0, 1), (1, 2), (2, 3), (2, 4), (3, 4), (0, 5), (1, 5), (5, 6), (6, 7), (7, 8), (8, 9), (9, 10), (10, 11),
                 (9, 12), (12, 13), (13, 14), (14, 15), (15, 16), (16, 17), (16, 18), (17, 18), (16, 19), (17, 19), (18, 19),
                 (19, 20)]

# путь через Суэц: id 26...43
edges_default += [(21, 22), (21, 23), (22, 23), (22, 24), (23, 24), (24, 25), (25, 26), (26, 27), (27, 28),
                  (28, 29), (27, 30), (30, 31), (31, 32), (32, 33), (32, 34), (33, 34), (34, 35), (35, 36)]
# Жд (транссиб): id 44...48
edges_default += [(37, 38), (38, 39), (39, 40), (40, 41), (41, 42)]
# трубопровод: id 49
edges_default += [(43, 44)]
# связываем смп и суэц: id 50...51
edges_default += [(36, 0), (20, 23)]

# перегрузочные ребра: id 52...53
edges_default += [
    (37, 3),  # перегруз с транссиба в СПб на СМП
    (42, 20),  # перегруз во владике с транссиба на СМП
    (43, 37),  # перегруз с трубы на трассиб в питере
    (44, 32)  # перегруз с трубы на суэц в британии
]


# ширина ребер
edges_width_default = [1 for _ in range(len(edges_default))]

